package com.xinyang.demo2;

public class BitOperator {
    public static void main(String[] args) {
        //& | ~ ^  按照补码计算
        System.out.println(2&3);
        //00000000 00000000 00000000 00000010
        //00000000 00000000 00000000 00000011
        //00000000 00000000 00000000 00000010
        System.out.println(2|3);
        //00000000 00000000 00000000 00000010
        //00000000 00000000 00000000 00000011
        //00000000 00000000 00000000 00000011
        System.out.println(2^3);
        //00000000 00000000 00000000 00000010
        //00000000 00000000 00000000 00000011
        //00000000 00000000 00000000 00000001
        System.out.println(~3);
        //00000000 00000000 00000000 00000011
        //11111111 11111111 11111111 11111100

        System.out.println("--------------------");
        //00000000 00000000 00000000 00000011
        //00000000 00000000 00000000 00000011

        //有符号移位  左移乘法  右移除法 适用于正数和负数
        System.out.println(4<<2);
        System.out.println(4>>2);
        System.out.println(-4<<2);
        System.out.println(-4>>2);
        //有符号移位  左移乘法  右移除法 适用于正数和负数
        System.out.println(-4>>>2);
    }
}
